In [ ]:
# # csv file read

import pandas as pd
# read csv
df = pd.read_csv("sample_sales.csv")
df

   Country         Region  Sales  Units Sold Category
0      USA  North America    500          50        A
1    India           Asia    700          70        B
2       UK         Europe    300          30        A
3  Germany         Europe    400          40        B
4   Brazil  South America    350          35        A
5    Japan           Asia    800          80        B
6    India           Asia    650          65        B
7      USA  North America    900          90        A
8       UK         Europe    200          20        A
9   Brazil  South America    450          45        B

In [ ]:
# # read csv with selected columns
df = pd.read_csv("sample_sales.csv",usecols=["Country","Sales"])
df

   Country  Sales
0      USA    500
1    India    700
2       UK    300
3  Germany    400
4   Brazil    350
5    Japan    800
6    India    650
7      USA    900
8       UK    200
9   Brazil    450

In [ ]:
# # read only first n rows
df = pd.read_csv("sample_sales.csv",nrows=5)
df

   Country         Region  Sales  Units Sold Category
0      USA  North America    500          50        A
1    India           Asia    700          70        B
2       UK         Europe    300          30        A
3  Germany         Europe    400          40        B
4   Brazil  South America    350          35        A

In [ ]:
# # Excel files
!pip install openpyxl
df = pd.read_excel("sample_sales.xlsx",sheet_name="sheet1")

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

[notice] A new release of pip is available: 24.2 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [ ]:
# # reading form url
df = pd.read_csv("url")

In [ ]:
# # from a python dictionary or list
data = {"name":["A","B"], "score":[90,80]}
df = pd.DataFrame(data)
df

  name  score
0    A     90
1    B     80

In [ ]:
# from numpy arrays
import numpy as np
arr = np.array([[1,2],[3,4]])

   0  1
0  1  2
1  3  4

In [29]:
#  Writing to csv
df.to_csv("sample_sales.csv",index=False)
# output.csv = output file
# index = F = dont save row numbers (indexex) unless needed
# columns=[....] = optionals saces of selected columns

AttributeError: 'NoneType' object has no attribute 'to_csv'

In [ ]:
# writing to excel
df.to_excel("output.xlsx",sheet_name="sheet1",index=False)

In [ ]:
#

In [ ]:
#

In [ ]:
#

In [ ]:
#

In [ ]:
#

In [ ]:
#

In [ ]:
#